---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PreferPatternAlignUiFilter
source: html/5fb01f69-0374-e283-eb6f-5e48c3bc7b39.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PreferPatternAlignUiFilter Property

"Pattern:": This is used by the UI to allow to select the preferred preference of aligning pattern.

## Syntax (C#)
```csharp
public static ForgeTypeId PreferPatternAlignUiFilter { get; }
```